In [1]:
import pandas as pd;
import numpy as np;

## Introduction to pandas Data Structures

### Series

- one-dimensional array-like object containing a sequence of values of the same type and an associated array of data labels, called its index

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2['a']

-5

In [8]:
obj2["d"] = 6
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [9]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [10]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [11]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [12]:
"e" in obj2

False

In [13]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [14]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [15]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)
obj4 # no value for California was found

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [16]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [18]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [20]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
obj3 + obj4 # Default , Outer 결측값이 하나라도 있는 Idx = NaN

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [22]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [23]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [24]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

- Represents a rectangular table of data and contains an ordered, named collection of columns, each of which can be a different value type. The DataFrame has both a row and column index; it can be thought of as a dictionary of Series all sharing the same index

- Possible data inputs to the DataFrame constructor

|Type|Notes|
|----|-----|
|2D ndarray|A matrix of data, passing optional row and column labels|
|Dictionary of arrays, lists, or tuples|Each sequence becomes a column in the DataFrame; all sequences must be the same length|
|NumPy structured/record array|Treated as the 'dictionary of arrays' case|
|Dictionary of Series|Each value becomes a column from each Series are unioned together to from the result's row index if no explicit index is passed|
|List of dictionaries or Series|Each item becomes a row in the DataFrame;unions of dictionary keys or Series indexes becom the DataFrame's column labels|
|List of lists or tuples|Treated as the "2D ndarray" case|
|Another DataFrame|The DataFrame's indexes are used unless different ones are passed|
|NumPy MaskedArray|Like the '2D ndarray' cas except masked values are missing in the DataFrame result|

In [25]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [27]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [28]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [29]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [30]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [31]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [32]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [33]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [34]:
frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [35]:
frame2["debt"] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [36]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   0.0     True
1  2001    Ohio  1.7   1.0     True
2  2002    Ohio  3.6   2.0     True
3  2001  Nevada  2.4   3.0    False
4  2002  Nevada  2.9   4.0    False
5  2003  Nevada  3.2   5.0    False

In [37]:
del frame2["eastern"]
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [38]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [39]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [40]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [41]:
pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}
pd.DataFrame(pdata)

/var/folders/td/4qb43vgx4w92xyck7j2hlgph0000gn/T/ipykernel_12326/3724106831.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  pdata = {"Ohio": frame3["Ohio"][:-1],
/var/folders/td/4qb43vgx4w92xyck7j2hlgph0000gn/T/ipykernel_12326/3724106831.py:2: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  "Nevada": frame3["Nevada"][:2]}

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [42]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [43]:
frame2.to_numpy() #If the DataFrame's columns are different dta types, the data type of the returned array will be chosen to accommodate all of the columns

array([[2000, 'Ohio', 1.5, 0.0],
       [2001, 'Ohio', 1.7, 1.0],
       [2002, 'Ohio', 3.6, 2.0],
       [2001, 'Nevada', 2.4, 3.0],
       [2002, 'Nevada', 2.9, 4.0],
       [2003, 'Nevada', 3.2, 5.0]], dtype=object)

### Index Objects

- pandas's Index objects are responsible for holding the axis labels(including a DataFrame's column names) and other metadata(like the axis name or names).  

- Some Index methods and properties  

|Method/Property|Description|
|---------------|-----------|
|append()|Concatenate with additional Index objects, producing a new Index|
|difference()|Compute set difference as an index|
|intersection()|Compute set intersection|
|union()|Compute set union|
|isin()|Compue Boolean array indicating whether each value is contained in the passed collection|
|delete()|Compute new Index with element at Index i deleted|
|drop()|Compute new Index by deleting passed values|
|insert()|Comptue new Index by inserting element at index i|
|is_monotonic|Returns True if each element is greater than or equal to the previous element|
|is_unique|Returns True if the Index has no duplicate values|
|unique()|Computhe the array of unique values in the Index|

In [44]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [45]:
index[1:]

Index(['b', 'c'], dtype='object')

In [46]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [47]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [48]:
"Ohio" in frame3.columns

True

In [49]:
2003 in frame3.index

False

## Essential Functionality

### Reindexing
- Create a new object with the values rearranged to align with the new index  

- reindex function arguments  

|Argument|Description|
|--------|-----------|
|labels|New sequence to use as an index. Can be Index instance or any other sequence-like Python data structure. An Index will be used exactly as is without any copying|
|index|Use the passed sequence as the new index labels|
|axis|The axis to reindex, whether "index"(rows)" or "columns". The default is "index". You can alternately do reindex(index = new_labels) or reindex(columns = new_labels)|
|method|Interpolation(fill)method,"ffill" forward, while "bfill" fills backwards.|
|fill_value|Substitue value to use when introducing missing data bye reindexing. Use fill_value = "missing"(the default behavior) when you want absent labels to have null values in the result|
|limit|When forward filling or backfilling, the maximum size gap(in number of elements) to fill.|
|tolerance|When forward filling or backfilling, the maximum size gap(in absolute numeric distance) to fill for inexact matches|
|level|Match simple Index on level of MultiIndex; otherwise select subset of.|
|copy|If True, always copy underlying data even if the new index is equivalent to the old index; if False, do no copy the data when the indexes are equivalent.|

In [50]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [51]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [52]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [53]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [54]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [55]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [56]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping Entries from an Axis

In [57]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [58]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [59]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [60]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [61]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [63]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [64]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, Selection, and Filtering

In [65]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [66]:
obj['b'] # Index Value

1.0

In [67]:
obj[1] # Index i

1.0

In [68]:
obj[2:4] # 모든 Value가 Index Value와 일치하면 Index Value로 , 하나라도 일치하지 않으면 Index i로 접근

c    2.0
d    3.0
dtype: float64

In [69]:
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [70]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [71]:
obj1

2    1
0    2
1    3
dtype: int64

In [72]:
obj2

a    1
b    2
c    3
dtype: int64

In [73]:
obj1[[0, 1, 2]] # 리스트 안의 값이 전부 Index value와 일치하므로

0    2
1    3
2    1
dtype: int64

In [74]:
obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [75]:
obj.iloc[[0,1,2]]

a    0.0
b    1.0
c    2.0
dtype: float64

In [76]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [77]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [78]:
obj2.loc["b":"c"] = 5
obj2

a    1
b    5
c    5
dtype: int64

In [79]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

```python
- dataFrame[value] or datFrame[[values]] => Column 반환
- dataFrame[slciing] => Row 반환
```

In [80]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [81]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [82]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [83]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [85]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection on DataFrame with loc and iloc

- Select a subset of the rows and columns with NumPy-like notation using either axis labels(loc) or integers(iloc).  

- Indexing options with DataFrame  

|Type|Notes|
|----|-----|
|df[column]|Select single column or sequence of columns from the DataFrae; special cas conveniences:Boolean array(filer rows), slike(slice rows), or Boolean DataFrame(set values based on some criterion)|
|df.locs[rows]|Select single row or subset of rows from the DataFrame by label|
|df.loc[:,cols]|Select single column or subset of columns by label|
|df.loc[rows,cols]|Select both row(s) and column(s) by label|
|df.iloc[rows]|Select single row or subset of rows from the DataFrame by integer position|
|df.iloc[:,rows]|Select single column or subset of columns by integer position|
|df.at[row,col]|Select a single scalar value by row and column label|
|df.iat[row,col]|Select a single scalar value by row and column position(integers)|
|reindex method|Select either rows or columns by labels|

In [86]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [87]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [88]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [89]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [90]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [91]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [92]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [93]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [94]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Integer indexing pitfalls

- Working with pandas objects indexed by integers can be a stumbling block for new users since they work differently from built-in Python data structrues like lists and tuples.

In [95]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [96]:
ser[-1]

KeyError: -1

- On the other hand, with a noninteger index, there is no such ambiguity

In [97]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
ser2[-1]

2.0

In [98]:
ser.iloc[-1]

2.0

In [99]:
ser[:2]

0    0.0
1    1.0
dtype: float64

#### Pifalls with chained indexing

In [100]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [101]:
data.loc[:, "one"] = 1

In [102]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [103]:
data.iloc[2] = 5

In [104]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [105]:
data.loc[data["four"] > 5] = 3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

### Arithmetic and Data Alignment

- Flexible arithmetic methods  

|Method|Description|
|------|-----------|
|add, radd|Methods for addition(+)|
|sub, rsub|Methods for subtraction(-)|
|div, rdiv|Methods for division(/)|
|floordiv, rfloordiv|Methods for floor division (//)|
|mul, rmul|Methods for multiplication(*)|
|pow, rpow|Methods for exponentiation(**)|

In [106]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])

In [107]:
s1 + s2 # missing values in the label locations that don't overlap

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [108]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [109]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In [110]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))
df2.loc[1,"b"] = np.nan
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [111]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [112]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [113]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [114]:
df1.reindex(columns=df2.columns, fill_value=0) # reindex with fill_value

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [115]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
series = frame.iloc[0]

In [116]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [117]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [118]:
frame - series # broadcasting by rows

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [119]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int64

In [120]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [121]:
series3 = frame["d"]
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [122]:
frame.sub(series3, axis=0) #broadcast over the columns

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

- NumPy functions also work with pandas objects

In [123]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -1.125575  0.479221  0.801993
Ohio    0.640825  0.504957 -0.224390
Texas   0.692432  0.507435 -0.513039
Oregon  0.159774 -1.030004 -1.214633

In [124]:
np.abs(frame)

               b         d         e
Utah    1.125575  0.479221  0.801993
Ohio    0.640825  0.504957  0.224390
Texas   0.692432  0.507435  0.513039
Oregon  0.159774  1.030004  1.214633

In [125]:
def f1(x):
    return x.max() - x.min()
frame.apply(f1) #default axis = 0

b    1.818007
d    1.537439
e    2.016626
dtype: float64

In [126]:
frame.apply(f1, axis=1)

Utah      1.927568
Ohio      0.865215
Texas     1.205471
Oregon    1.374408
dtype: float64

In [127]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])
frame.apply(f2)

            b         d         e
min -1.125575 -1.030004 -1.214633
max  0.692432  0.507435  0.801993

In [128]:
frame.apply(f2, axis=1)

             min       max
Utah   -1.125575  0.801993
Ohio   -0.224390  0.640825
Texas  -0.513039  0.692432
Oregon -1.214633  0.159774

In [129]:
def my_format(x):
    return f"{x:.2f}"

frame.applymap(my_format)

            b      d      e
Utah    -1.13   0.48   0.80
Ohio     0.64   0.50  -0.22
Texas    0.69   0.51  -0.51
Oregon   0.16  -1.03  -1.21

In [130]:
frame["e"].map(my_format)

Utah       0.80
Ohio      -0.22
Texas     -0.51
Oregon    -1.21
Name: e, dtype: object

### Sorting and Ranking

- Tie-breaking methods with rank

|Method|Description|
|------|-----------|
|"average"|Default:assing the average rank to each entry in the equal group|
|"min"|Use the minimum rand for the whole group|
|"max"|Use the maximum rank for the whole group|
|"first"|Assign ranks in the order the values appear in the data|
|"dense"|"Like method = "min", but ranks always increase by 1 between groups rather than the number of equal elements in a roup|

In [131]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [132]:
obj.sort_index() # Index 기준으로 정렬

a    1
b    2
c    3
d    0
dtype: int64

In [133]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [134]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [135]:
frame.sort_index(axis=1) # 열 인덱스 기준 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [136]:
frame.sort_index(axis=1, ascending=False)  # 내림차순

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [137]:
obj = pd.Series([4, 7, -3, 2]) 
obj.sort_values() # 값기준 정렬

2   -3
3    2
0    4
1    7
dtype: int64

In [138]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values() # Missing values are sorted to the end of Series

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [139]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [140]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [141]:
frame.sort_values("b") # 값의 기준이 될 열 정하기.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [142]:
frame.sort_values(["a", "b"]) # 우선순위는 앞에 올수록

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [143]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [144]:
obj.rank(method="first") # 값이 같을 경우, Index가 빠른 value 부터 rank 부어

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [145]:
obj.rank(ascending=False) # 내림차순

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [146]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexs with Duplicate Labels

In [147]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [148]:
obj.index.is_unique

False

In [149]:
obj['a']

a    0
a    1
dtype: int64

In [150]:
obj['c']

4

In [151]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df

          0         1         2
a -0.645155 -2.182163  0.958541
a  0.115791  0.911300 -0.614193
b -1.069190  0.034252 -0.008978
b  0.040409  1.147121  1.473090
c  0.084881 -0.078655  0.575840

In [152]:
df.loc["b"]

          0         1         2
b -1.069190  0.034252 -0.008978
b  0.040409  1.147121  1.473090

In [153]:
df.loc["c"]

0    0.084881
1   -0.078655
2    0.575840
Name: c, dtype: float64

## Summarizing and Computing Descriptive Statistics

- Options for reduction methods  

|Method|Description|
|------|-----------|
|axis|Axis to reduce over; "index" for DataFrame's rows and "columns" for columns|
|skipna|Exclude missing values; True by default|
|level|Reduce grouped by level if the axis is hierarchically indexed(MultiIndex)|  

- Descriptive and summary statistics  

|Method|Description|
|------|-----------|
|count|Number of non-NA values|
|describe|Compute set of summary statistics|
|min, max|Compute minimum and maximum values|
|argmin, argmax|Compute index locations(integers) at which minimum or maximum value is obtained, respectively; not available on DataFrame objects|
|idxmin, idxmax|Compute index laabels at which minimum or maximum value is obtained, respectively|
|quantile|Compute sample quantile rangin from 0 to 1(default:0.5)|
|sum|Sum of values|
|mean|Mean of values|
|median|Arithmetic median(50% quantile) of values|
|mad|Mean absolute deviation from mean value|
|prod|Product of all values|
|var|Sample variance of values|
|std|Sample standard deviation of values|
|skew|Sample skewness(thid moment) of values|
|kurt|Sample kurtosis(fourth moment) of values|
|cumsum|Cumulative sum of values|
|cummin, cummax|Cummulative minimum or maximum of values, respectively|
|cumprod|Cumulative product of values|
|diff|Compute first arithmetic difference(useful for time series)|
|pct_change|Compute percent changes|

In [154]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [155]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [156]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [157]:
df.sum(skipna=False)

one   NaN
two   NaN
dtype: float64

In [158]:
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [159]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [160]:
df.idxmax()

one    b
two    d
dtype: object

In [161]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [162]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [163]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj.describe() # On nonnumeric data, describe produces alternative summary statistics

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation anad Covariance

- Computed from pairs of arguments.

In [164]:
price = pd.read_pickle("yahoo_price.pkl")
volume = pd.read_pickle("yahoo_volume.pkl")

In [165]:
price.head()

                 AAPL        GOOG         IBM       MSFT
Date
2010-01-04  27.990226  313.062468  113.304536  25.884104
2010-01-05  28.038618  311.683844  111.935822  25.892466
2010-01-06  27.592626  303.826685  111.208683  25.733566
2010-01-07  27.541619  296.753749  110.823732  25.465944
2010-01-08  27.724725  300.709808  111.935822  25.641571

In [166]:
volume.head()

                 AAPL      GOOG      IBM      MSFT
Date
2010-01-04  123432400   3927000  6155300  38409100
2010-01-05  150476200   6031900  6841400  49749600
2010-01-06  138040000   7987100  5605300  58182400
2010-01-07  119282800  12876600  5840600  50559700
2010-01-08  111902700   9483900  4197200  51197400

In [169]:
returns = price.pct_change() #(다음행 - 현재행)÷현재행
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [170]:
returns['MSFT'].corr(returns['IBM'])

0.49976361144151155

In [171]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [172]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [174]:
returns.corrwith(volume) # corrwidth : 두 DataFrame 객체의 동일한 행/열 간의 상관 계쑤를 반환

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

### Unique Values, Value Counts, and Membership

- Unique, value counts, and set membership methods  

|Method|Description|
|------|-----------|
|isin|Compute a Boolean array indicating whether each Series or DataFrame value is contained in the passed sequence of values|
|get_indexer|Compute integer indices for each value in an array into another array of distinct values;helpful for data alignment and join-type operaations|
|unique|Compute an array of unique values in a Series, returned in the order observed|
|value_counts|Return a Series containing unique values as its index and frequencies as its values, ordered count in descending order|

In [175]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [176]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [179]:
obj.value_counts() #sorted by value in descending order as a convenience.

c    3
a    3
b    2
d    1
dtype: int64

In [180]:
obj.value_counts(sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [181]:
mask = obj.isin(["b", "c"])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [182]:
obj[mask] # boolean indexing

0    c
5    b
6    b
7    c
8    c
dtype: object

In [183]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
unique_vals = pd.Series(["c", "b", "a"])
indices = pd.Index(unique_vals).get_indexer(to_match) # 시리즈에서 각 원소가 특정 Index의 어느 인덱스인지 확인

indices

array([0, 2, 1, 1, 0, 2])

In [184]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [185]:
data['Qu1'].value_counts().sort_index()

1    1
3    2
4    2
Name: Qu1, dtype: int64

In [186]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [187]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [188]:
data.value_counts() # data.apply(pd.value_counts) 와의 차이점 파악

a  b
1  0    2
2  0    2
1  1    1
dtype: int64